;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! polymode)
(package! groovy-mode)

(package! clang-format)

(package! gitlab-ci-mode)
(package! gitlab-ci-mode-flycheck)

(package! visual-regexp)

(package! cmake-font-lock)

(package! platformio-mode)

(package! editorconfig)
(package! icicles)

(package! scad-mode)
(package! scad-preview)

(package! magit-section)

(package! flymd)
